; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	spectrograph2 - mode
	image0 - mode
	thermograph3 - mode
	spectrograph1 - mode
	GroundStation1 - direction
	Star3 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	GroundStation9 - direction
	GroundStation4 - direction
	Star2 - direction
	GroundStation0 - direction
	Star8 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 image0)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument1 spectrograph2)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 Star2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon17)
)
(:goal (and
	(have_image Star10 spectrograph1)
	(have_image Star11 spectrograph2)
	(have_image Star12 spectrograph2)
	(have_image Phenomenon13 thermograph3)
	(have_image Planet14 image0)
	(have_image Phenomenon15 spectrograph1)
	(have_image Phenomenon16 spectrograph2)
	(have_image Phenomenon17 image0)
))

)

; plan
1. (turn_to satellite1 groundstation0 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 groundstation0)
   goals met: 0 of 8
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 8
3. (calibrate satellite1 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 8
4. (turn_to satellite1 phenomenon13 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon13)
   goals met: 0 of 8
5. (turn_to satellite0 groundstation4 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 8
6. (take_image satellite1 phenomenon13 instrument1 thermograph3)
   added: (have_image phenomenon13 thermograph3)
   goals met: 1 of 8
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 8
8. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 1 of 8
9. (turn_to satellite0 phenomenon15 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon15)
   goals met: 1 of 8
10. (take_image satellite0 phenomenon15 instrument0 spectrograph1)
   added: (have_image phenomenon15 spectrograph1)
   goals met: 2 of 8
11. (turn_to satellite0 phenomenon16 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon16)
   goals met: 2 of 8
12. (take_image satellite0 phenomenon16 instrument0 spectrograph2)
   added: (have_image phenomenon16 spectrograph2)
   goals met: 3 of 8
13. (turn_to satellite0 phenomenon17 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon17)
   goals met: 3 of 8
14. (take_image satellite0 phenomenon17 instrument0 image0)
   added: (have_image phenomenon17 image0)
   goals met: 4 of 8
15. (turn_to satellite0 planet14 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 planet14)
   goals met: 4 of 8
16. (take_image satellite0 planet14 instrument0 image0)
   added: (have_image planet14 image0)
   goals met: 5 of 8
17. (turn_to satellite0 star10 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star10)
   goals met: 5 of 8
18. (take_image satellite0 star10 instrument0 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 6 of 8
19. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 6 of 8
20. (take_image satellite0 star11 instrument0 spectrograph2)
   added: (have_image star11 spectrograph2)
   goals met: 7 of 8
21. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 7 of 8
22. (take_image satellite0 star12 instrument0 spectrograph2)
   added: (have_image star12 spectrograph2)
   goals met: 8 of 8
